In [ ]:
# operations: fillna, dropna, groupby, pivot, merge
import pandas as pd

# titanic dataset again
titanic = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [ ]:
# fillna
filled_titanic = titanic.fillna({'Age': titanic['Age'].mean()})

In [ ]:
# dropna
dropped_titanic = filled_titanic.dropna(subset=['Embarked'])

In [ ]:
print(dropped_titanic.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [ ]:
# groupby and mean
grouped_age = dropped_titanic.groupby('Pclass')['Age'].mean()
print(grouped_age)

Pclass
1    36.927073
2    29.866958
3    26.403259
Name: Age, dtype: float64

In [ ]:
# pivot
pivoted = dropped_titanic.pivot_table(index='Pclass', columns='Sex', values='Fare', aggfunc='mean')
print(pivoted)

Sex         female       male
Pclass
1       106.693750  67.226127
2        21.970121  19.741782
3        16.118810  12.661633

In [ ]:
# merge with ports
ports = pd.DataFrame({ 'Embarked': ['S', 'C', 'Q'], 'Port_Name': ['Southampton', 'Cherbourg', 'Queenstown']})
merged = pd.merge(dropped_titanic, ports, on='Embarked', how='left')
print(merged[['Name', 'Embarked', 'Port_Name']].head())

                                                Name Embarked    Port_Name
0                            Braund, Mr. Owen Harris        S  Southampton
1  Cumings, Mrs. John Bradley (Florence Briggs Th...        C    Cherbourg
2                             Heikkinen, Miss. Laina        S  Southampton
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)        S  Southampton
4                           Allen, Mr. William Henry        S  Southampton